In [1]:
import pandas as pd

## 예제 7-4   샘플링 데이터 처리하기

!python -m pip install --upgrade pip

!pip install pandas_datareader --upgrade

In [2]:
from pandas_datareader import data

In [3]:
import datetime

In [4]:
start = datetime.datetime(2018, 1, 2)

In [5]:
end = datetime.datetime(2018, 4, 3)

In [6]:
cel = data.DataReader("068270.KS", "yahoo", start, end)

In [7]:
cel.head()

              High     Low    Open   Close   Volume  Adj Close
Date
2018-01-03  230812  212045  213725  230345  2582354     230345
2018-01-04  243884  229038  233053  233427  3497379     233427
2018-01-05  249300  237162  238002  249206  2057303     249206
2018-01-08  283100  258824  260037  282446  4603982     282446
2018-01-09  298786  271895  283847  273109  5471400     273109

In [8]:
cel.sample(n=3)

              High     Low    Open   Close   Volume  Adj Close
Date
2018-02-02  286088  270775  280392  281419  1764643     281419
2018-01-16  327171  312979  318394  324370  1766752     324370
2018-01-03  230812  212045  213725  230345  2582354     230345

In [9]:
cel.sample(n=3)

              High     Low    Open   Close   Volume  Adj Close
Date
2018-03-09  331466  301587  322596  304388  3811334     304388
2018-02-26  306256  299253  299720  304855   885860     304855
2018-03-05  366013  333333  360878  348740  3359031     348740

#### 무작위적으로 처리

In [10]:
cel.sample(n=3,replace=True)

              High     Low    Open   Close   Volume  Adj Close
Date
2018-02-21  290850  281979  283847  287115   776647     287115
2018-02-06  271895  254155  257890  265359  2780682     265359
2018-03-08  330532  308590  309057  330532  8291062     330532

In [11]:
cel.shape

(62, 6)

In [12]:
int(cel.shape[0]/10)

6

In [13]:
cel.sample(frac=0.1)

              High     Low    Open   Close   Volume  Adj Close
Date
2018-03-29  296919  275444  277311  295985  2094550     295985
2018-02-19  304388  290850  304388  295518  1440786     295518
2018-02-06  271895  254155  257890  265359  2780682     265359
2018-04-03  284314  277311  279645  279178   931887     279178
2018-03-07  328198  302988  323996  303455  8126833     303455
2018-01-25  275444  263585  271989  270495  1492804     270495

In [14]:
cel.sample(frac=0.1,replace=True)

              High     Low    Open   Close   Volume  Adj Close
Date
2018-01-23  280205  264799  267787  279178  2403152     279178
2018-03-07  328198  302988  323996  303455  8126833     303455
2018-02-27  330999  308590  311858  327731  2246829     327731
2018-03-09  331466  301587  322596  304388  3811334     304388
2018-03-22  297852  284781  291317  289916  1260721     289916
2018-01-26  281699  263585  267974  280112  1699214     280112

In [15]:
cel.sample(frac=0.1,random_state=100 )

              High     Low    Open   Close   Volume  Adj Close
Date
2018-01-18  301961  285341  288422  298133  2092865     298133
2018-02-12  290850  275444  275910  282446  2262290     282446
2018-03-22  297852  284781  291317  289916  1260721     289916
2018-01-29  315126  274416  274416  306536  2306835     306536
2018-03-13  299720  284781  299720  290383  3191279     290383
2018-01-19  299533  265546  298786  268721  4022212     268721

In [16]:
cel_sam = cel.sample(frac=0.1,random_state=100 )

In [17]:
type(cel_sam)

pandas.core.frame.DataFrame

In [18]:
cel_sam.describe()

,High,Low,Open,Close,Volume,Adj Close
count,6.000000,6.000000,6.000000,6.000000,6.000000e+00,6.000000
mean,300840.333333,278384.833333,288095.166667,289355.833333,2.522700e+06,289355.833333
std,7962.880501,7993.071135,10913.437450,13016.203616,9.578407e+05,13016.203616
min,290850.000000,265546.000000,274416.000000,268721.000000,1.260721e+06,268721.000000
25%,298272.250000,274673.000000,279038.000000,284313.500000,2.135221e+06,284313.500000
50%,299626.500000,280112.500000,289869.500000,290149.500000,2.284562e+06,290149.500000
75%,301400.750000,284781.000000,296918.750000,296195.500000,2.970168e+06,296195.500000
max,315126.000000,285341.000000,299720.000000,306536.000000,4.022212e+06,306536.000000

In [19]:
cel_sam.mean()

High         3.008403e+05
Low          2.783848e+05
Open         2.880952e+05
Close        2.893558e+05
Volume       2.522700e+06
Adj Close    2.893558e+05
dtype: float64

In [20]:
cel_sam.std()

High           7962.880501
Low            7993.071135
Open          10913.437450
Close         13016.203616
Volume       957840.728657
Adj Close     13016.203616
dtype: float64

In [21]:
cel_sam.var()

High         6.340747e+07
Low          6.388919e+07
Open         1.191031e+08
Close        1.694216e+08
Volume       9.174589e+11
Adj Close    1.694216e+08
dtype: float64

## 예제 7-5   리샘플링 데이터 처리하기

In [22]:
from pandas_datareader import data

In [23]:
cel_re = data.DataReader("068270.KS", "yahoo", '2018-01-02', '2018-08-31')

In [24]:
cel_re.head()

              High     Low    Open   Close   Volume  Adj Close
Date
2018-01-03  230812  212045  213725  230345  2582354     230345
2018-01-04  243884  229038  233053  233427  3497379     233427
2018-01-05  249300  237162  238002  249206  2057303     249206
2018-01-08  283100  258824  260037  282446  4603982     282446
2018-01-09  298786  271895  283847  273109  5471400     273109

In [25]:
cel_re.resample('BA')

In [26]:
a = cel_re.resample('BA')

In [27]:
count = 0
for i in dir(a) :
    if not i.startswith("_") :
        print(i, end=",  ")
        count += 1
        if count % 6 == 0 :
            print()

Close,  High,  Low,  Open,  Volume,  agg,
aggregate,  apply,  asfreq,  ax,  backfill,  bfill,
count,  ffill,  fillna,  first,  get_group,  groups,
indices,  interpolate,  last,  max,  mean,  median,
min,  ndim,  nearest,  ngroups,  nunique,  obj,
ohlc,  pad,  pipe,  plot,  prod,  quantile,
sem,  size,  std,  sum,  transform,  var,

In [28]:
a.High.head()

Date
2018-01-03    230812
2018-01-04    243884
2018-01-05    249300
2018-01-08    283100
2018-01-09    298786
Name: High, dtype: int64

In [29]:
cel_2018 = cel_re.resample('BA')

In [30]:
cel_2018.ndim

2

In [31]:
cel_2018.ngroups

1

In [32]:
cel_2018.size()

Date
2018-12-31    164
Freq: BA-DEC, dtype: int64

In [33]:
cel_2018.mean().round(2)

                 High        Low       Open     Close      Volume  Adj Close
Date
2018-12-31  277168.04  263695.88  270191.41  269777.5  1541272.75   269777.5

In [34]:
cel_2018.std().round(2)

                High       Low      Open     Close      Volume  Adj Close
Date
2018-12-31  25786.93  22955.01  24739.27  24515.17  1354117.64   24515.17

In [35]:
cel_2018.var().round(1)

,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,
2018-12-31,664965806.6,526932710.1,612031570.8,600993768.3,1.833635e+12,600993768.3

In [36]:
year = cel_re.resample('A')

In [37]:
year.mean().round(2)

                 High        Low       Open     Close      Volume  Adj Close
Date
2018-12-31  277168.04  263695.88  270191.41  269777.5  1541272.75   269777.5

In [38]:
cel_bq = cel.resample('BQ')

In [39]:
cel_bq.mean().round(2)

                 High        Low       Open      Close      Volume  Adj Close
Date
2018-03-30  299259.27  280331.48  289013.35  289718.28  2581370.77  289718.28
2018-06-29  289682.50  280579.00  284780.50  281512.50   842396.00  281512.50

In [40]:
cel_q = cel.resample('Q')

In [41]:
cel_q.mean().round(2)

                 High        Low       Open      Close      Volume  Adj Close
Date
2018-03-31  299259.27  280331.48  289013.35  289718.28  2581370.77  289718.28
2018-06-30  289682.50  280579.00  284780.50  281512.50   842396.00  281512.50

In [42]:
cel_bm = cel.resample('BM')

In [43]:
cel_bm.mean().round(2)

                 High        Low       Open      Close      Volume  Adj Close
Date
2018-01-31  293010.57  271135.05  280320.95  282535.19  2900048.57  282535.19
2018-02-28  292888.22  274847.06  282280.33  284251.39  2191073.11  284251.39
2018-03-30  310968.86  294228.86  303476.90  301587.29  2597233.81  301587.29
2018-04-30  289682.50  280579.00  284780.50  281512.50   842396.00  281512.50

In [44]:
cel_m = cel.resample('M')

In [45]:
cel_m.mean().round(2)

                 High        Low       Open      Close      Volume  Adj Close
Date
2018-01-31  293010.57  271135.05  280320.95  282535.19  2900048.57  282535.19
2018-02-28  292888.22  274847.06  282280.33  284251.39  2191073.11  284251.39
2018-03-31  310968.86  294228.86  303476.90  301587.29  2597233.81  301587.29
2018-04-30  289682.50  280579.00  284780.50  281512.50   842396.00  281512.50

In [46]:
cel_w = cel.resample('W')

In [47]:
cel_w.mean().round(2).head()

                High        Low      Open      Close      Volume  Adj Close
Date
2018-01-07  241332.0  226081.67  228260.0  237659.33  2712345.33  237659.33
2018-01-14  302371.6  273370.60  281792.6  287488.20  4382206.80  287488.20
2018-01-21  317124.2  292474.40  310140.0  302147.60  2979940.20  302147.60
2018-01-28  279869.4  263305.20  271914.2  273165.20  2049579.80  273165.20
2018-02-04  303137.4  283641.20  291409.8  293520.00  1903098.00  293520.00

In [48]:
cel_d = cel.resample('D')

In [49]:
cel.shape

(62, 6)

In [50]:
cel_d.count().shape

(91, 6)

In [51]:
interpolated = cel_d.interpolate(method='linear').astype('int64')

In [52]:
interpolated.head(7)

              High     Low    Open   Close   Volume  Adj Close
Date
2018-01-03  230812  212045  213725  230345  2582354     230345
2018-01-04  243884  229038  233053  233427  3497379     233427
2018-01-05  249300  237162  238002  249206  2057303     249206
2018-01-06  260566  244382  245347  260286  2906196     260286
2018-01-07  271833  251603  252692  271366  3755089     271366
2018-01-08  283100  258824  260037  282446  4603982     282446
2018-01-09  298786  271895  283847  273109  5471400     273109

In [53]:
cel.head()

              High     Low    Open   Close   Volume  Adj Close
Date
2018-01-03  230812  212045  213725  230345  2582354     230345
2018-01-04  243884  229038  233053  233427  3497379     233427
2018-01-05  249300  237162  238002  249206  2057303     249206
2018-01-08  283100  258824  260037  282446  4603982     282446
2018-01-09  298786  271895  283847  273109  5471400     273109

In [54]:
in_spline = cel_d.interpolate(method='spline', order=2).astype('int64')

C:\COSMOS\Anaconda3\envs\pyenv3\lib\site-packages\scipy\interpolate\fitpack2.py:253: UserWarning:
The maximal number of iterations maxit (set to 20 by the program)
allowed for finding a smoothing spline with fp=s has been reached: s
too small.
There is an approximation returned but the corresponding weighted sum
of squared residuals does not satisfy the condition abs(fp-s)/s < tol.
  warnings.warn(message)

In [55]:
in_spline.head(7)

              High     Low    Open   Close   Volume  Adj Close
Date
2018-01-03  230812  212045  213725  230345  2582354     230345
2018-01-04  243884  229038  233053  233427  3497379     233427
2018-01-05  249300  237162  238002  249206  2057303     249206
2018-01-06  256745  242772  240451  266299  1835881     266299
2018-01-07  267890  247950  244187  280999  3180751     280999
2018-01-08  283100  258824  260037  282446  4603982     282446
2018-01-09  298786  271895  283847  273109  5471400     273109

In [56]:
index = pd.date_range('1/1/2018', periods=9, freq='T')

In [57]:
series = pd.Series(range(9), index=index)

In [58]:
series

2018-01-01 00:00:00    0
2018-01-01 00:01:00    1
2018-01-01 00:02:00    2
2018-01-01 00:03:00    3
2018-01-01 00:04:00    4
2018-01-01 00:05:00    5
2018-01-01 00:06:00    6
2018-01-01 00:07:00    7
2018-01-01 00:08:00    8
Freq: T, dtype: int64

In [59]:
series.resample('3T').sum()

2018-01-01 00:00:00     3
2018-01-01 00:03:00    12
2018-01-01 00:06:00    21
Freq: 3T, dtype: int64

In [60]:
series.resample('3T', label='right').sum()

2018-01-01 00:03:00     3
2018-01-01 00:06:00    12
2018-01-01 00:09:00    21
Freq: 3T, dtype: int64

In [61]:
series.resample('3T', label='right', closed='right').sum()

2018-01-01 00:00:00     0
2018-01-01 00:03:00     6
2018-01-01 00:06:00    15
2018-01-01 00:09:00    15
Freq: 3T, dtype: int64

In [62]:
index_h = pd.date_range('1/1/2018', periods=9, freq='H')

In [63]:
series_h = pd.Series(range(9), index=index_h)

In [64]:
series_h

2018-01-01 00:00:00    0
2018-01-01 01:00:00    1
2018-01-01 02:00:00    2
2018-01-01 03:00:00    3
2018-01-01 04:00:00    4
2018-01-01 05:00:00    5
2018-01-01 06:00:00    6
2018-01-01 07:00:00    7
2018-01-01 08:00:00    8
Freq: H, dtype: int64

In [65]:
sh_re = series_h.resample('3H')

In [66]:
type(sh_re)

pandas.core.resample.DatetimeIndexResampler

In [67]:
series_h.resample('3H').sum()

2018-01-01 00:00:00     3
2018-01-01 03:00:00    12
2018-01-01 06:00:00    21
Freq: 3H, dtype: int64

In [68]:
sh = series_h.asfreq(freq='3H')

In [69]:
type(sh)

pandas.core.series.Series

In [70]:
sh

2018-01-01 00:00:00    0
2018-01-01 03:00:00    3
2018-01-01 06:00:00    6
Freq: 3H, dtype: int64

## 예제 7-6 추가 메소드 적용하기

In [71]:
from pandas_datareader import data

In [72]:
cel_s = data.DataReader("068270.KS", "yahoo", '2018-01-02', '2018-08-31')

In [73]:
cel_s.corr()

               High       Low      Open     Close    Volume  Adj Close
High       1.000000  0.958222  0.962288  0.969028  0.425471   0.969028
Low        0.958222  1.000000  0.967921  0.964572  0.224852   0.964572
Open       0.962288  0.967921  1.000000  0.919116  0.303828   0.919116
Close      0.969028  0.964572  0.919116  1.000000  0.342265   1.000000
Volume     0.425471  0.224852  0.303828  0.342265  1.000000   0.342265
Adj Close  0.969028  0.964572  0.919116  1.000000  0.342265   1.000000

In [74]:
cel_s.cumsum().head()

               High      Low     Open    Close    Volume  Adj Close
Date
2018-01-03   230812   212045   213725   230345   2582354     230345
2018-01-04   474696   441083   446778   463772   6079733     463772
2018-01-05   723996   678245   684780   712978   8137036     712978
2018-01-08  1007096   937069   944817   995424  12741018     995424
2018-01-09  1305882  1208964  1228664  1268533  18212418    1268533

In [75]:
cel_s.cumsum().tail()

                High       Low      Open     Close     Volume  Adj Close
Date
2018-08-27  44431749  42249394  43298319  43239775  250220899   43239775
2018-08-28  44693187  42500561  43559290  43490942  251019202   43490942
2018-08-29  44949023  42751728  43810457  43742576  251458400   43742576
2018-08-30  45201124  42998693  44062558  43991409  252049128   43991409
2018-08-31  45455559  43246125  44311391  44243510  252768731   44243510

In [76]:
cel_s.cumprod()['High'].head()

Date
2018-01-03                 230812
2018-01-04            56291353808
2018-01-05      14033434504334400
2018-01-08    6815332329515042560
2018-01-09    8253853757812993536
Name: High, dtype: int64

In [77]:
cel_as = cel_s.astype('float64')

In [78]:
cel_as.cumprod()['High'].iloc[100]

inf